<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Import-pandas-and-load-the-NLS-weeks-worked-and-college-enrollment-data" data-toc-modified-id="Import-pandas-and-load-the-NLS-weeks-worked-and-college-enrollment-data-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas and load the NLS weeks worked and college enrollment data</a></span></li><li><span><a href="#Look-at-some-of-the-NLS-weeks-worked-data" data-toc-modified-id="Look-at-some-of-the-NLS-weeks-worked-data-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Look at some of the NLS weeks worked data</a></span></li><li><span><a href="#Look-at-some-of-the-NLS-college-enrollment-data" data-toc-modified-id="Look-at-some-of-the-NLS-college-enrollment-data-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Look at some of the NLS college enrollment data</a></span></li><li><span><a href="#Check-for-unique-values-in-the-merge-by-columns" data-toc-modified-id="Check-for-unique-values-in-the-merge-by-columns-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Check for unique values in the merge-by columns</a></span></li><li><span><a href="#Check-for-mismatches-in-the-merge-by-columns" data-toc-modified-id="Check-for-mismatches-in-the-merge-by-columns-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Check for mismatches in the merge-by columns</a></span></li><li><span><a href="#Perform-a-merge-with-multiple-merge-by-columns" data-toc-modified-id="Perform-a-merge-with-multiple-merge-by-columns-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Perform a merge with multiple merge-by columns</a></span></li></ul></div>

# Import pandas and load the NLS weeks worked and college enrollment data

In [1]:
import pandas as pd

In [2]:
# pd.set_option('display.width', 80)
# pd.set_option('display.max_columns', 7)
# pd.set_option('display.max_rows', 100)
# pd.options.display.float_format = '{:,.0f}'.format

In [3]:
import watermark
%load_ext watermark

%watermark -n -i -iv

json     : 2.0.9
watermark: 2.1.0
pandas   : 1.2.1

In [5]:
nls97weeksworked = pd.read_csv('data/nls97weeksworked.csv')
nls97colenr = pd.read_csv('data/nls97colenr.csv')

# Look at some of the NLS weeks worked data

In [6]:
nls97weeksworked.sample(10, random_state=1)

       originalid  year  weeksworked
32923        7199  2003          0.0
14214        4930  2001         52.0
2863         4727  2000         13.0
9746         6502  2001          0.0
2479         4036  2000         28.0
39435        1247  2004         52.0
36416        3481  2004         52.0
6145         8892  2000         19.0
5348         8411  2000          0.0
24193        4371  2002         34.0

In [7]:
nls97weeksworked.shape

(44920, 3)

In [9]:
nls97weeksworked['originalid'].nunique()

8984

# Look at some of the NLS college enrollment data

In [10]:
nls97colenr.sample(10, random_state=1)

       originalid  year              colenr
32923        7199  2003     1. Not enrolled
14214        4930  2001     1. Not enrolled
2863         4727  2000                 NaN
9746         6502  2001     1. Not enrolled
2479         4036  2000     1. Not enrolled
39435        1247  2004   3. 4-year college
36416        3481  2004     1. Not enrolled
6145         8892  2000     1. Not enrolled
5348         8411  2000     1. Not enrolled
24193        4371  2002  2. 2-year college

In [11]:
nls97colenr.shape

(44920, 3)

In [12]:
nls97colenr['originalid'].nunique()

8984

# Check for unique values in the merge-by columns

In [13]:
nls97weeksworked.groupby(['originalid', 'year'])['originalid'].count().shape

(44920,)

In [14]:
nls97colenr.groupby(['originalid', 'year'])['originalid'].count().shape

(44920,)

# Check for mismatches in the merge-by columns

In [19]:
def checkmerge(dfleft, dfright, idvar):
    dfleft['inleft'] = 'Y'
    dfright['inright'] = 'Y'
    
    dfboth = pd.merge(dfleft[idvar + ['inleft']], dfright[idvar + ['inright']], on=idvar, how='outer')
    dfboth.fillna('N', inplace=True)
    print(pd.crosstab(dfboth['inleft'], dfboth['inright']))

In [20]:
checkmerge(nls97weeksworked.copy(),nls97colenr.copy(), ['originalid','year'])

inright      Y
inleft
Y        44920

# Perform a merge with multiple merge-by columns

In [22]:
nlsworkschool = pd.merge(nls97weeksworked, nls97colenr, on=['originalid', 'year'], how='inner')

In [23]:
nlsworkschool.shape

(44920, 4)

In [24]:
nlsworkschool.sample(10, random_state=1)

       originalid  year  weeksworked              colenr
32923        7199  2003          0.0     1. Not enrolled
14214        4930  2001         52.0     1. Not enrolled
2863         4727  2000         13.0                 NaN
9746         6502  2001          0.0     1. Not enrolled
2479         4036  2000         28.0     1. Not enrolled
39435        1247  2004         52.0   3. 4-year college
36416        3481  2004         52.0     1. Not enrolled
6145         8892  2000         19.0     1. Not enrolled
5348         8411  2000          0.0     1. Not enrolled
24193        4371  2002         34.0  2. 2-year college